# Задача 2: Найдите сумму цифр трехзначного числа.

# n = int(input('введите трехзначное число    '))
# a = n%10 
# n = n//10
# b = n%10 
# c = n//10 
# res = a + b + c
# print(res)

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько 
# журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество 
# журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# a=int(input("Всего журавликов: ")) 
# b=a//6 
# c=b*4 
# print(f"Петя сделал  {b} журавлик(а/ов)") 
# print(f"Катя сделала {c} журавлик(а/ов)") 
# print(f"Серёжа сделал {b} журавлик(а/ов)")

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и 
# получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – 
# счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# n = int(input('введите шестизначный номер билета       '))

# f=n%10
# n=n//10
# e=n%10
# n=n//10
# d=n%10
# n=n//10
# c=n%10
# n=n//10
# b=n%10
# a=n//10

# g=a+b+c
# h=d+e+f

# if g == h:
#     print('yes, you have a happy ticket, you can eat it and be happy')
# else:
#     print('your ticket is not happy')

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если 
# разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

# n = int(input('введите длину шоколадки   '))
# m = int(input('введите ширину шоколадки   '))
# k = int(input('введите количество долек, которые хотите отломить  '))
# if (k < n * m) and ((k % n == 0) or (k % m == 0)):
#     print('YES')
# else:
#     print('NO')