# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# a1 = int(input('Введите первое число арифметической прогрессии: '))
# d = int(input('Введите разность: '))
# n = int(input('Введите количество элементов: '))
# for i in range(n):
#     print(a1 + i * d, end=' ')

# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному 
# диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)

# import random
# def generate_list(len_list):
#     list_1 = []
#     for i in range(len_list):
#         list_1.append(random.randint(1, 10))
#     return list_1

# len_list = int(input('Введите длину массива: '))
# list_1 = generate_list(len_list)
# print(list_1)
# min = int(input('Введите минимальный диапазон: '))
# max = int(input('Введите максимальный диапазон: '))

# list_2 = []
# for i in range (len(list_1)):
#     if list_1[i] >= min and list_1[i] <= max:
#         list_2.append(i)
# print(list_2)







