# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке 
# возрастания все те числа, которые встречаются в обоих наборах. Пользователь вводит 2 числа. n — кол-во элементов 
# первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

# n=int(input("введите количество элементов первого множества:  "))
# set_1 = set()
# for i in range(n):
#     set_1.add(input("введите число:  "))
# print(set_1)

# m=int(input("введите количество элементов второго множества:  "))
# set_2 = set()
# for i in range(m):
#     set_2.add(input("введите число:  "))
# print(set_2)
# print(sorted(set_1 & set_2))


# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, 
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. 
# Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора на 
# них выросло различное число ягод — на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве внедрена 
# система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких 
# собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним. Напишите программу для нахождения максимального числа 
# ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной 
# во входном файле грядки.

# bushes = int(input('Введите количество кустов: '))
# berries = list()
# for i in range(bushes):
#     a = int(input('Введите количество ягод на кусте: '))
#     berries.append(a)

# berries_count = list()
# for i in range(len(berries)):
#        berries_count.append(berries[i-2] + berries[i-1] + berries[i])
# print(berries_count)
# print(max(berries_count))
